
import os
from playsound import playsound
import sys

sys.stdout.reconfigure(encoding='utf-8')


MONTHS = {
    1: {"text": "января", "audio": "jan.mp3"},
    2: {"text": "февраля", "audio": "feb.mp3"},
    3: {"text": "марта", "audio": "mar.mp3"},
    4: {"text": "апреля", "audio": "apr.mp3"},
    5: {"text": "мая", "audio": "may.mp3"},
    6: {"text": "июня", "audio": "jun.mp3"},
    7: {"text": "июля", "audio": "jul.mp3"},
    8: {"text": "августа", "audio": "aug.mp3"},
    9: {"text": "сентября", "audio": "sen.mp3"},
    10: {"text": "октября", "audio": "okt.mp3"},
    11: {"text": "ноября", "audio": "nov.mp3"},
    12: {"text": "декабря", "audio": "dec.mp3"}
}




time_hours_data = {
    0: {"text": "ноль", "audio": "0.mp3"},
    1: {"text": "один", "audio": "odin.mp3"},
    2: {"text": "два", "audio": "2.mp3"},
    3: {"text": "три", "audio": "3.mp3"},
    4: {"text": "четыре", "audio": "4.mp3"},
    5: {"text": "пять", "audio": "5.mp3"},
    6: {"text": "шесть", "audio": "6.mp3"},
    7: {"text": "семь", "audio": "7.mp3"},
    8: {"text": "восемь", "audio": "8.mp3"},
    9: {"text": "девять", "audio": "9.mp3"},
    10: {"text": "десять", "audio": "10.mp3"},
    11: {"text": "одиннадцать", "audio": "11.mp3"},
    12: {"text": "двенадцать", "audio": "12.mp3"},
    13: {"text": "тринадцать", "audio": "13.mp3"},
    14: {"text": "четырнадцать", "audio": "14.mp3"},
    15: {"text": "пятнадцать", "audio": "15.mp3"},
    16: {"text": "шестнадцать", "audio": "16.mp3"},
    17: {"text": "семнадцать", "audio": "17.mp3"},
    18: {"text": "восемнадцать", "audio": "18.mp3"},
    19: {"text": "девятнадцать", "audio": "19.mp3"},
    20: {"text": "двадцать", "audio": "20_mav.wav"},
    21: {"text": "двадцать один", "audio": ["20.mp3", "odin.mp3"]},
    22: {"text": "двадцать два", "audio": ["20.mp3", "2.mp3"]},
    23: {"text": "двадцать три", "audio": ["20.mp3", "3.mp3"]}
}

time_minutes_data = {
    0: {"text": "ноль", "audio": "0.mp3"},
    1: {"audio": "odna.mp3", "text": "одна"},
    2: {"audio": "2ve.mp3", "text": "две"},
    3: {"audio": "3.mp3", "text": "три"},
    4: {"audio": "4.mp3", "text": "четыре"},
    5: {"audio": "5.mp3", "text": "пять"},
    6: {"audio": "6.mp3", "text": "шесть"},
    7: {"audio": "7.mp3", "text": "семь"},
    8: {"audio": "8.mp3", "text": "восемь"},
    9: {"audio": "9.mp3", "text": "девять"},
    10: {"audio": "10.mp3", "text": "десять"},
    11: {"audio": "11.mp3", "text": "одиннадцать"},
    12: {"audio": "12.mp3", "text": "двенадцать"},
    13: {"audio": "13.mp3", "text": "тринадцать"},
    14: {"audio": "14.mp3", "text": "четырнадцать"},
    15: {"audio": "15.mp3", "text": "пятнадцать"},
    16: {"audio": "16.mp3", "text": "шестнадцать"},
    17: {"audio": "17.mp3", "text": "семнадцать"},
    18: {"audio": "18.mp3", "text": "восемнадцать"},
    19: {"audio": "19.mp3", "text": "девятнадцать"},
    20: {"audio": "20_mav.wav", "text": "двадцать"},
    21: {"audio": ["20.mp3", "odna.mp3"], "text": "двадцать одна"},
    22: {"audio": ["20.mp3", "2ve.mp3"], "text": "двадцать две"},
    23: {"audio": ["20.mp3", "3.mp3"], "text": "двадцать три"},
    24: {"audio": ["20.mp3", "4.mp3"], "text": "двадцать четыре"},
    25: {"audio": ["20.mp3", "5.mp3"], "text": "двадцать пять"},
    26: {"audio": ["20.mp3", "6.mp3"], "text": "двадцать шесть"},
    27: {"audio": ["20.mp3", "7.mp3"], "text": "двадцать семь"},
    28: {"audio": ["20.mp3", "8.mp3"], "text": "двадцать восемь"},
    29: {"audio": ["20.mp3", "9.mp3"], "text": "двадцать девять"},
    30: {"audio": "30.mp3", "text": "тридцать"},
    31: {"audio": ["30.mp3", "odna.mp3"], "text": "тридцать одна"},
    32: {"audio": ["30.mp3", "2ve.mp3"], "text": "тридцать две"},
    33: {"audio": ["30.mp3", "3.mp3"], "text": "тридцать три"},
    34: {"audio": ["30.mp3", "4.mp3"], "text": "тридцать четыре"},
    35: {"audio": ["30.mp3", "5.mp3"], "text": "тридцать пять"},
    36: {"audio": ["30.mp3", "6.mp3"], "text": "тридцать шесть"},
    37: {"audio": ["30.mp3", "7.mp3"], "text": "тридцать семь"},
    38: {"audio": ["30.mp3", "8.mp3"], "text": "тридцать восемь"},
    39: {"audio": ["30.mp3", "9.mp3"], "text": "тридцать девять"},
    40: {"audio": "40.mp3", "text": "сорок"},
    41: {"audio": ["40.mp3", "odna.mp3"], "text": "сорок одна"},
    42: {"audio": ["40.mp3", "2ve.mp3"], "text": "сорок две"},
    43: {"audio": ["40.mp3", "3.mp3"], "text": "сорок три"},
    44: {"audio": ["40.mp3", "4.mp3"], "text": "сорок четыре"},
    45: {"audio": ["40.mp3", "5.mp3"], "text": "сорок пять"},
    46: {"audio": ["40.mp3", "6.mp3"], "text": "сорок шесть"},
    47: {"audio": ["40.mp3", "7.mp3"], "text": "сорок семь"},
    48: {"audio": ["40.mp3", "8.mp3"], "text": "сорок восемь"},
    49: {"audio": ["40.mp3", "9.mp3"], "text": "сорок девять"},
    50: {"audio": "50.mp3", "text": "пятьдесят"},
    51: {"audio": ["50.mp3", "odna.mp3"], "text": "пятьдесят одна"},
    52: {"audio": ["50.mp3", "2ve.mp3"], "text": "пятьдесят две"},
    53: {"audio": ["50.mp3", "3.mp3"], "text": "пятьдесят три"},
    54: {"audio": ["50.mp3", "4.mp3"], "text": "пятьдесят четыре"},
    55: {"audio": ["50.mp3", "5.mp3"], "text": "пятьдесят пять"},
    56: {"audio": ["50.mp3", "6.mp3"], "text": "пятьдесят шесть"},
    57: {"audio": ["50.mp3", "7.mp3"], "text": "пятьдесят семь"},
    58: {"audio": ["50.mp3", "8.mp3"], "text": "пятьдесят восемь"},
    59: {"audio": ["50.mp3", "9.mp3"], "text": "пятьдесят девять"}
}


year_data = {
    2001: {"text": "две тысячи первого", "audio": ["2000.mp3", "1go.mp3"]},
    2002: {"text": "две тысячи второго", "audio": ["2000.mp3", "2go.mp3"]},
    2003: {"text": "две тысячи третьего", "audio": ["2000.mp3", "3go.mp3"]},
    2004: {"text": "две тысячи четвертого", "audio": ["2000.mp3", "4go.mp3"]},
    2005: {"text": "две тысячи пятого", "audio": ["2000.mp3", "5go.mp3"]},
    2006: {"text": "две тысячи шестого", "audio": ["2000.mp3", "6go.mp3"]},
    2007: {"text": "две тысячи седьмого", "audio": ["2000.mp3", "7go.mp3"]},
    2008: {"text": "две тысячи восьмого", "audio": ["2000.mp3", "8go.mp3"]},
    2009: {"text": "две тысячи девятого", "audio": ["2000.mp3", "9go.mp3"]},
    2010: {"text": "две тысячи десятого", "audio": ["2000.mp3", "10go.mp3"]},
    2011: {"text": "две тысячи одиннадцатого", "audio": ["2000.mp3", "11go.mp3"]},
    2012: {"text": "две тысячи двенадцатого", "audio": ["2000.mp3", "12go.mp3"]},
    2013: {"text": "две тысячи тринадцатого", "audio": ["2000.mp3", "13go.mp3"]},
    2014: {"text": "две тысячи четырнадцатого", "audio": ["2000.mp3", "14go.mp3"]},
    2015: {"text": "две тысячи пятнадцатого", "audio": ["2000.mp3", "15go.mp3"]},
    2016: {"text": "две тысячи шестнадцатого", "audio": ["2000.mp3", "16go.mp3"]},
    2017: {"text": "две тысячи семнадцатого", "audio": ["2000.mp3", "17go.mp3"]},
    2018: {"text": "две тысячи восемнадцатого", "audio": ["2000.mp3", "18go.mp3"]},
    2019: {"text": "две тысячи девятнадцатого", "audio": ["2000.mp3", "19go.mp3"]},
    2020: {"text": "две тысячи двадцатого", "audio": ["2000.mp3", "20go.mp3"]},
    2021: {"text": "две тысячи двадцать первого", "audio": ["2000.mp3", "20.mp3", "1go.mp3"]},
    2022: {"text": "две тысячи двадцать второго", "audio": ["2000.mp3", "20.mp3" ,"2go.mp3"]},
    2023: {"text": "две тысячи двадцать третьего", "audio": ["2000.mp3", "20.mp3" ,"3go.mp3"]},
    2024: {"text": "две тысячи двадцать четвертого", "audio": ["2000.mp3", "20.mp3", "4go.mp3"]},
    2025: {"text": "две тысячи двадцать пятого", "audio": ["2000.mp3", "20.mp3" ,"5go.mp3"]}
}

    
constant = {
   1:{"audio": "chas.mp3", "text": "час"},
       2:{"audio": "chasa.mp3", "text": "часа"},
           3:{"audio": "chasov.mp3", "text": "часов"},
               4:{"audio": "mina.mp3", "text": "минута"},
                   5:{"audio": "minuti.mp3", "text": "минуты"},
                       6:{"audio": "min.mp3", "text": "минут"},
                            7:{"audio": "1000ch.mp3", "text": "тысяч"},
                                8:{"audio": "1000chi.mp3", "text": "тысячи"},
                                    9:{"audio": "1000cha.mp3", "text": "тысяча"},
                                        10:{"audio":"yeara.mp3", "text":"года"}
                            
    
}
    
    

time_data = {
    1: {"audio": "1go.mp3", "text": "первого"},
    2: {"audio": "2go.mp3", "text": "второго"},
    3: {"audio": "3go.mp3", "text": "третьего"},
    4: {"audio": "4go.mp3", "text": "четвертого"},
    5: {"audio": "5go.mp3", "text": "пятого"},
    6: {"audio": "6go.mp3", "text": "шестого"},
    7: {"audio": "7go.mp3", "text": "седьмого"},
    8: {"audio": "8go.mp3", "text": "восьмого"},
    9: {"audio": "9go.mp3", "text": "девятого"},
    10: {"audio": "10go.mp3", "text": "десятого"},
    11: {"audio": "11go.mp3", "text": "одиннадцатого"},
    12: {"audio": "12go.mp3", "text": "двенадцатого"},
    13: {"audio": "13go.mp3", "text": "тринадцатого"},
    14: {"audio": "14go.mp3", "text": "четырнадцатого"},
    15: {"audio": "15go.mp3", "text": "пятнадцатого"},
    16: {"audio": "16go.mp3", "text": "шестнадцатого"},
    17: {"audio": "17go.mp3", "text": "семнадцатого"},
    18: {"audio": "18go.mp3", "text": "восемнадцатого"},
    19: {"audio": "19go.mp3", "text": "девятнадцатого"},
    20: {"audio": "20go.mp3", "text": "двадцатого"},
    21: {"audio": ["20.mp3", "1go.mp3"], "text": "двадцать первого"},
    22: {"audio": ["20.mp3", "2go.mp3"], "text": "двадцать второго"},
    23: {"audio": ["20.mp3", "3go.mp3"], "text": "двадцать третьего"},
    24: {"audio": ["20.mp3", "4go.mp3"], "text": "двадцать четвертого"},
    25: {"audio": ["20.mp3", "5go.mp3"], "text": "двадцать пятого"},
    26: {"audio": ["20.mp3", "6go.mp3"], "text": "двадцать шестого"},
    27: {"audio": ["20.mp3", "7go.mp3"], "text": "двадцать седьмого"},
    28: {"audio": ["20.mp3", "8go.mp3"], "text": "двадцать восьмого"},
    29: {"audio": ["20.mp3", "9go.mp3"], "text": "двадцать девятого"},
    30: {"audio": "30go.mp3", "text": "тридцатого"},
    31: {"audio": ["30.mp3", "1go.mp3"], "text": "тридцать первого"}
}


